balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F87K90.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA13" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="LCDDATA13" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S08C2" edc:desc="" edc:mask="0x1" edc:name="S08C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C2" edc:desc="" edc:mask="0x1" edc:name="S09C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C2" edc:desc="" edc:mask="0x1" edc:name="S10C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C2" edc:desc="" edc:mask="0x1" edc:name="S11C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C2" edc:desc="" edc:mask="0x1" edc:name="S12C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C2" edc:desc="" edc:mask="0x1" edc:name="S13C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C2" edc:desc="" edc:mask="0x1" edc:name="S14C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C2" edc:desc="" edc:mask="0x1" edc:name="S15C2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA14" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="LCDDATA14" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S16C2" edc:desc="" edc:mask="0x1" edc:name="S16C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C2" edc:desc="" edc:mask="0x1" edc:name="S17C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C2" edc:desc="" edc:mask="0x1" edc:name="S18C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C2" edc:desc="" edc:mask="0x1" edc:name="S19C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C2" edc:desc="" edc:mask="0x1" edc:name="S20C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C2" edc:desc="" edc:mask="0x1" edc:name="S21C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C2" edc:desc="" edc:mask="0x1" edc:name="S22C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C2" edc:desc="" edc:mask="0x1" edc:name="S23C2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA15" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="LCDDATA15" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S24C2" edc:desc="" edc:mask="0x1" edc:name="S24C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C2" edc:desc="" edc:mask="0x1" edc:name="S25C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C2" edc:desc="" edc:mask="0x1" edc:name="S26C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C2" edc:desc="" edc:mask="0x1" edc:name="S27C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C2" edc:desc="" edc:mask="0x1" edc:name="S28C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C2" edc:desc="" edc:mask="0x1" edc:name="S29C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C2" edc:desc="" edc:mask="0x1" edc:name="S30C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C2" edc:desc="" edc:mask="0x1" edc:name="S31C2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA16" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="LCDDATA16" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S32C2" edc:desc="" edc:mask="0x1" edc:name="S32C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S33C2" edc:desc="" edc:mask="0x1" edc:name="S33C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S34C2" edc:desc="" edc:mask="0x1" edc:name="S34C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S35C2" edc:desc="" edc:mask="0x1" edc:name="S35C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S36C2" edc:desc="" edc:mask="0x1" edc:name="S36C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S37C2" edc:desc="" edc:mask="0x1" edc:name="S37C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S38C2" edc:desc="" edc:mask="0x1" edc:name="S38C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S39C2" edc:desc="" edc:mask="0x1" edc:name="S39C2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA17" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="LCDDATA17" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S40C2" edc:desc="" edc:mask="0x1" edc:name="S40C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S41C2" edc:desc="" edc:mask="0x1" edc:name="S41C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S42C2" edc:desc="" edc:mask="0x1" edc:name="S42C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S43C2" edc:desc="" edc:mask="0x1" edc:name="S43C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S44C2" edc:desc="" edc:mask="0x1" edc:name="S44C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S45C2" edc:desc="" edc:mask="0x1" edc:name="S45C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S46C2" edc:desc="" edc:mask="0x1" edc:name="S46C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S47C2" edc:desc="" edc:mask="0x1" edc:name="S47C2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA18" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="LCDDATA18" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S00C3" edc:desc="" edc:mask="0x1" edc:name="S00C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C3" edc:desc="" edc:mask="0x1" edc:name="S01C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C3" edc:desc="" edc:mask="0x1" edc:name="S02C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C3" edc:desc="" edc:mask="0x1" edc:name="S03C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C3" edc:desc="" edc:mask="0x1" edc:name="S04C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C3" edc:desc="" edc:mask="0x1" edc:name="S05C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C3" edc:desc="" edc:mask="0x1" edc:name="S06C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C3" edc:desc="" edc:mask="0x1" edc:name="S07C3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
